
GetPassphraseDescription = "Potřebujete heslo pro odemknutí tajného klíče uživatele: „%@“, ID %@";
GetPassphraseDescription_Subkey = "Potřebujete heslo pro odemknutí tajného klíče uživatele: „%@“, ID %@, (ID hlavního klíče %@)";
PassphraseLabel = "Heslo:";




/* For Key-Status */
"Invalid" = "Neplatný";
"Revoked" = "Zneplatněno";
"Expired" = "Platnost vypršela";
"Disabled" = "Zakázáno";
"Unknown" = "Neznámý";
"Never" = "Nikdy";
"Marginal" = "Okrajový";
"Full" = "Plný";
"Ultimate" = "Ultimátní";


/* For Undo and Redo */
Undo_NewKey = "Nový klíč";
Undo_Delete = "Smazat";
Undo_CleanKey = "Vyčistit";
Undo_MinimizeKey = "Minimalizovat";
Undo_RevokeKey = "Zneplatnit klíč";
Undo_ChangeExpirationDate = "Změnit datum platnosti";
Undo_ChangePassphrase = "Změnit heslo";
Undo_AlgorithmPreferences = "Zmenit výchozí metodu";
Undo_Import = "Importovat";
Undo_AddSignature = "Přidat podpis";
Undo_RemoveSignature = "Odstranit podpis";
Undo_RevokeSignature = "Zneplatnit podpis";
Undo_AddSubkey = "Přidat podklíč";
Undo_RemoveSubkey = "Odstranit podklíč";
Undo_RevokeSubkey = "Zneplatnit podklíč";
Undo_AddUserID = "Přidat userID";
Undo_RemoveUserID = "Odstranit userID";
Undo_RevokeUserID = "Zneplatnit userID";
Undo_PrimaryUserID = "Primární userID";
Undo_AddPhoto = "Fotografie";
Undo_RefreshFromServer = "Obnoveno ze serveru";
Undo_ReceiveFromServer = "Zkopírováno ze serveru";



/* Algorithm names */
CIPHER_ALGO_NONE = "Nic";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "Nic";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_ECDHAlgorithm = "ECDH";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "DiffieHellman";
GPG_EdDSAAlgorithm = "EdDSA";
"Algorithm_%i" = "Metoda_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "Podepsáno";
"Signature expired" = "Platnost podpisu vypršela";
"Key expired" = "Platnost klíče vypršela";
"Bad signature" = "Podpis a údaje si neodpovídají. Mohlo by to znamenat, že data jsou podvržena útočníkem.";
"Signature revoked" = "Podpis byl zneplatněný";
"Signature error" = "Chyba podpisu";
"Unverifiable signature" = "Podpis nelze ověřit.";
"Signed by stranger" = "Podpis nelze ověřit, protože odpovídající veřejný klíč chybí.";


/* Key Descriptions */
KeyDescriptionAndMore = "a %lu více";


/* Key Expiry Warning */
KeyExpiryWarning_Title = "Upozornění: Brzo vyprší platnost vašeho klíče";
KeyExpiryWarning_Msg = "Platnost vašeho klíče vyprší %1$@:\n\n%2$@\n\nNeplatné klíče nelze použít pro šifrování a podepisování nových zpráv. Dešifrování zpráv bude i nadále fungovat. Vaši přátelé vám nebudou moci posílat zprávy podepsané tímto klíčem.\n\nPokud zvolíte prodloužení platnosti vašeho klíče, budete ho moci používat další dva roky.\n\nPřejete si prodloužit platnost vašeho klíče?";
KeyExpiryWarning_Yes = "Prodloužit platnost klíče";
KeyExpiryWarning_No = "Zrušit";
KeyExpiryWarning_Suppress = "Příště se neptat";

SubkeyExpiryWarning_Title = "Upozornění: Brzo vyprší platnost vašeho podklíče";
SubkeyExpiryWarning_Msg = "Platnost vašeho podklíče vyprší %1$@:\n\n%2$@\n\nNeplatné podklíče nelze použít pro šifrování a podepisování nových zpráv. Dešifrování zpráv bude i nadále fungovat. Vaši přátelé vám nebudou moci posílat zprávy podepsané tímto podklíčem.\n\nPokud zvolíte prodloužení platnosti vašeho podklíče, budete ho moci používat další dva roky.\n\nPřejete si prodloužit platnost vašeho podklíče?";
SubkeyExpiryWarning_Yes = "Prodloužit platnost podklíče";
SubkeyExpiryWarning_No = "Zrušit";
SubkeyExpiryWarning_Suppress = "Příště se neptat";

WrongPasswordTryAgain_Title = "Zadal jste nesprávné heslo";
WrongPasswordTryAgain_Msg = "Přejete si zkusit to znovu?";
WrongPasswordTryAgain_Yes = "Zkusit znovu";
WrongPasswordTryAgain_No = "Zrušit";

KeyExpiryFailed_Title = "Prodloužení platnosti klíče se nezdařilo!";
KeyExpiryFailed_Msg = "Klíči\n%1$@\nnelze prodloužit platnost.\n\nChyba: %2$@";

KeyExtendedWantToUpload_Title = "Platnost klíče byla prodloužena úspěšně";
KeyExtendedWantToUpload_Msg = "Aby ostatní mohli vidět nové prodloužené datum platnosti, je nutné, aby importovali váš aktualizovaný klíč. Proto doporučujeme zkopírovat aktualizovaný veřejný klíč na klíčové servery.\n\nUpozornění: Klíčové servery jsou veřejné, takže jméno a e-mail, který používáte ve vašem klíči, budou veřejně viditelné. Klíče na klíčových serverech mohou být zneplatněny, ale nelze je smazat.\n\nPokud raději nepoužíváte klíčové servery, zvažte připojení veřejného klíče k podepsaným a šifrovaným e-mailům\n\nChcete zkopírovat váš veřejný klíč?";
KeyExtendedWantToUpload_Yes = "Zkopírovat veřejný klíč";
KeyExtendedWantToUpload_No = "Ne, děkuji!";

UploadFailed_Title = "Kopírování klíče se nezdařilo!";
UploadFailed_Msg = "Klíč nelze zkopírovat na klíčový server.\n\nChyba: %@";


UpdaterNotWorking_Title = "Aktualizační systém GPG Suite nepracuje správně!";
UpdaterNotWorking_Msg = "Zkopírujte a nainstalujte prosím nejnovější verzi GPG Suite z umístění https://gpgtools.org";


SwitchToOldKeyserver_Title = "Warning: You are about to switch the key server";
SwitchToOldKeyserver_Msg = "Switching to the old key servers will lower the quality of search results. While keys.openpgp.org allows verification of the email address and only then will show the email in search results, the old key servers do not support that mechanism.\n\nWe recommend to keep using keys.openpgp.org\n\nDo you really want to switch the key server?";
SwitchToOldKeyserver_No = "Zrušit";
SwitchToOldKeyserver_Yes = "Switch to old Key Server";


